var dataShop = [
	["商店","出售列表","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
	["防具店","盾钩","王家之盾","精灵之盾","布手帕","发带","皮帽","隼木","头巾","礼帽","护额","神圣的帽子","锁头盔","青铜头盔","钢铁舵并","银制头盔","暗黑头盔","铁面具","布腰带","皱巴巴的衬衣","水手衬衣","轻薄盔甲","丝绸衣裳","厚斗篷","锁单衣","毛皮大衣","护胸铁甲","青铜盔甲","银色盔甲","全身铠甲","王者披风"],
	["狙击店","初学者弓","长杆","轻羽之弓","水晶杆","勇者之弓","步枪","猎枪","大口径短枪","青铜枪","来福枪","速射炮","","","","","","","","","","","","","","","","","","",""],
	["武器店","木制斧头","樵夫之斧","铁制斧头","战斧","水晶之斧","破坏之斧","锤锤","木锤","战锤","金锤","妖精之锤","长枪","捕鱼叉","针铁蜂","三叉戟","水晶针蜂","出航之杖","特产之杖","魔导师之杖","魔法棒","水晶棒","木棒","棍棒","叉子","钩","铁爪","针刺棒","","",""],
	["道具店","新鲜蔬菜","清晨鲜豆","甜味浆果","成熟橘子","菠萝","葡萄汁","迷你回复药","回复药剂","回复秘药","SP回复水","SP回复药","SP能量饮料","光环之药","速度之药","蛋绿色提升","蛋红色提升","蛋蓝色提升","蛋紫色提升","蛋绿抑制","蛋红抑制","蛋蓝抑制","蛋紫抑制","蛋黄抑制","蛋黑抑制","","","","","",""],
	["刀剑店","水果刀","菜刀","战斗短刀","青铜小刀","银制短刀","龙刀","细剑","短剑","长菜刀","长剑","青铜剑","铁剑","利刃","银色之刃","暗黑剑","龙剑","","","","","","","","","","","","","",""],
	["饰品店","大海护符","平板鞋","挂坠","珍珠指环","长靴","乘船之铃","守护符","银指环","蝴蝶领带","隼之靴","金项链","战斗手环","钢铁靴","","","","","","","","","","","","","","","","",""],
]